In [146]:
import unicodecsv
import pandas as pd
#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [147]:
user = read_csv('../data_20180120/customer.csv')

In [148]:
users = pd.DataFrame(user)
users[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,"2,083",ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
1,"2,102",ทดสอบ002,N,1900036840,,,,,,,,,,,,,
2,"2,223",Ping,N,1900036887,,,,,,,,,,,,,
3,"2,224",มาศสุภา,N,1900036888,,,,,,,,,,,,,
4,"2,284",Tanate,N,1900036922,,,,,,,,,,,,,

In [149]:
len(users)

36212

# คัดเอาis nullออก

In [150]:
import locale
locale.setlocale(locale.LC_ALL, '') 

neww_users = users[:]

neww_users['CUSTOMER_ID'] = users['CUSTOMER_ID'].apply(locale.atoi)
neww_users_birth = neww_users[neww_users['DATE_OF_BIRTH'].notnull() & (neww_users['DATE_OF_BIRTH'] != "")]

neww_users_birth[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,2083,ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
13,2390,ภิญญามาศ,N,1100700539,770/73,10250,01010000000,กรุงเทพมหานคร,ถ.พัฒนาการ,01011230000,แขวงสวนหลวง,01011230120,เขตสวนหลวง,HOUSE,หมู่บ้านพาทิโอ,,1986-8-11
16,2406,พัชรา,N,1100698992,ห้อง55/56,10150,01010000000,กรุงเทพมหานคร,ราชพฤกษ์,01010870000,แขวงบางค้อ,01010870055,เขตจอมทอง,CONDOMINIUM,คอนโดIdeo วุฒากาศ,บล.หลักทรัพย์ฟิลลิป,1983-10-10
21,2412,ณภัทร,N,1100463792,164/316,11110,01240000000,จ.นนทบุรี,บางกรวย-ไทรน้อย,01244250000,ต.พิมลราช,01244254131,อ.บางบัวทอง,HOUSE,,,1989-10-25
22,2413,ทวีศักดิ์,N,1100694276,320/144 (ตึก A ห้อง 1009),11000,01240000000,จ.นนทบุรี,รัตนาธิเบศร์,01246240000,ต.บางกระสอ,01246243042,อ.เมืองนนทบุรี,CONDOMINIUM,ลุมพินีพาร์ค รัตนาธิเบศร์-งามวงศ์วาน,,1982-6-4

# customer ที่ไม่ได้filter

In [151]:
cutomer_no_filter = neww_users[neww_users['DATE_OF_BIRTH'].notnull() & (neww_users['DATE_OF_BIRTH'] != "")]

In [152]:
df_age_null = users['DATE_OF_BIRTH']
df_age_null[:10]

0    1988-10-30
1
2
3
4
5
6
7
8
9
Name: DATE_OF_BIRTH, dtype: object

In [153]:
date_null = pd.DataFrame(df_age_null)
date_null[:4]

  DATE_OF_BIRTH
0    1988-10-30
1
2
3

In [170]:
from datetime import datetime

def bd_to_age(bd_str):
    if  (bd_str != ""):
        datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
        now = datetime.now().date()
        delta = (now - datetime_ob)
        number_of_days = delta.days
        number_of_years = number_of_days/365
        return number_of_years
    else:
        return None

In [171]:
bd_to_age('1988-10-30')

29.30958904109589

In [172]:
age_null = date_null['DATE_OF_BIRTH'].apply(bd_to_age)
age_null[:5]

0    29.309589
1          NaN
2          NaN
3          NaN
4          NaN
Name: DATE_OF_BIRTH, dtype: float64

# รวม id age address

In [175]:
id_x = neww_users['CUSTOMER_ID']

In [176]:
df_customer= pd.DataFrame(id_x)

In [122]:
customer = neww_users_birth['CUSTOMER_ID']
address = neww_users_birth['ADDRESS_POSTAL_CODE']
date = neww_users_birth['DATE_OF_BIRTH']


new_users = pd.concat([customer,address,date], axis=1)
new_users[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE DATE_OF_BIRTH
0          2083               20170    1988-10-30
13         2390               10250     1986-8-11
16         2406               10150    1983-10-10
21         2412               11110    1989-10-25
22         2413               11000      1982-6-4

In [123]:
new_users.dtypes

CUSTOMER_ID             int64
ADDRESS_POSTAL_CODE    object
DATE_OF_BIRTH          object
dtype: object

In [126]:
new_users = new_users.convert_objects(convert_numeric=True)

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

In [127]:
new_users.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE    float64
DATE_OF_BIRTH           object
dtype: object

In [128]:
address_only = users['ADDRESS_POSTAL_CODE']
address_only[:5]

0    20170
1
2
3
4
Name: ADDRESS_POSTAL_CODE, dtype: object

In [129]:
df_address = pd.DataFrame(address_only ,columns=['ADDRESS_POSTAL_CODE'])
df_address[:5]

  ADDRESS_POSTAL_CODE
0               20170
1
2
3
4

# check null

In [130]:
pd.isnull(df_address).sum()>0

ADDRESS_POSTAL_CODE    False
dtype: bool

# เอา empty ออกจาก address

In [131]:
df_address = pd.DataFrame(address_only ,columns=['ADDRESS_POSTAL_CODE'])
df_address[:5].convert_objects(convert_numeric=True)[:4]

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.

   ADDRESS_POSTAL_CODE
0              20170.0
1                  NaN
2                  NaN
3                  NaN

In [132]:
address2 = df_address.convert_objects(convert_numeric=True).dropna()
address2[:5]

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

    ADDRESS_POSTAL_CODE
0               20170.0
9               11120.0
10              10210.0
13              10250.0
16              10150.0

# รวมแถว customer กับ address

In [133]:
id_address = pd.concat([customer,address2], axis=1)
id_address[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0        2083.0              20170.0
9           NaN              11120.0
10          NaN              10210.0
13       2390.0              10250.0
16       2406.0              10150.0

# ตัด null ออก

In [134]:
 id_notnull = id_address[id_address['CUSTOMER_ID'].notnull()&(id_address['ADDRESS_POSTAL_CODE'].notnull())]
id_notnull[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0        2083.0              20170.0
13       2390.0              10250.0
16       2406.0              10150.0
21       2412.0              11110.0
22       2413.0              11000.0

In [135]:
len(id_notnull)

10276

In [136]:
pd.isnull(id_notnull).sum()>0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
dtype: bool

In [137]:
id_notnull.to_csv('../data_clean/customer_address.csv', index = False)

In [180]:
id_age_add = pd.concat([df_customer,age_null,address2], axis=1)
id_age_add[:5]

   CUSTOMER_ID  DATE_OF_BIRTH  ADDRESS_POSTAL_CODE
0         2083      29.309589              20170.0
1         2102            NaN                  NaN
2         2223            NaN                  NaN
3         2224            NaN                  NaN
4         2284            NaN                  NaN

In [183]:
id_age_add.to_csv('../data_clean/customer.csv', index = False)

# Age

In [84]:
len(id_notnull)

10276

In [85]:
new_users.dtypes

CUSTOMER_ID             int64
ADDRESS_POSTAL_CODE    object
DATE_OF_BIRTH          object
dtype: object

In [86]:
new_users[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE DATE_OF_BIRTH
0          2083               20170    1988-10-30
13         2390               10250     1986-8-11
16         2406               10150    1983-10-10
21         2412               11110    1989-10-25
22         2413               11000      1982-6-4

# Convert date to age

In [87]:
y_m_d = new_users['DATE_OF_BIRTH']
y_m_d[:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

In [88]:

from datetime import datetime
now = datetime.now()
now

datetime.datetime(2018, 2, 13, 14, 27, 41, 85052)

In [89]:
 y = now.year
y

2018

In [90]:
 y- int('1988')

30

In [91]:
from datetime import datetime

def bd_to_age(bd_str):
    datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
    now = datetime.now().date()
    delta = (now - datetime_ob)
    number_of_days = delta.days
    number_of_years = number_of_days/365
    return number_of_years

In [92]:
bd_to_age('1988-10-30')

29.30958904109589

# Age

In [93]:
 age_dirt = new_users['DATE_OF_BIRTH'].apply(bd_to_age)
age_dirt[:5]

0     29.309589
13    31.531507
16    34.369863
21    28.323288
22    35.720548
Name: DATE_OF_BIRTH, dtype: float64

In [94]:
len(age_dirt)

10594

# รวมแถวที่มี id&address&date

In [95]:
users_all = pd.concat([customer,address,age_dirt], axis=1)
users_all[:10]

    CUSTOMER_ID ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0          2083               20170      29.309589
13         2390               10250      31.531507
16         2406               10150      34.369863
21         2412               11110      28.323288
22         2413               11000      35.720548
24         2416               10280      35.873973
26         2082               11120      41.336986
27         2142               10140      29.531507
32         2291               12130      33.616438
36         2316               10250      22.589041

In [96]:
pd.isnull(users_all).sum() > 0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
DATE_OF_BIRTH          False
dtype: bool

In [97]:
users_all['Age'] = age_dirt
users_all[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE  DATE_OF_BIRTH        Age
0          2083               20170      29.309589  29.309589
13         2390               10250      31.531507  31.531507
16         2406               10150      34.369863  34.369863
21         2412               11110      28.323288  28.323288
22         2413               11000      35.720548  35.720548

# ลบแถวDATE_OF_BIRTH

In [98]:
del users_all['DATE_OF_BIRTH']

users_all[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE        Age
0          2083               20170  29.309589
13         2390               10250  31.531507
16         2406               10150  34.369863
21         2412               11110  28.323288
22         2413               11000  35.720548

In [99]:
len(users_all)

10594

# check max of age

In [100]:
users_all.loc[users_all['Age'].idxmax()]

CUSTOMER_ID              55624
ADDRESS_POSTAL_CODE      11110
Age                    2017.46
Name: 9726, dtype: object

# กำหนดเอาค่าอายุระหว่าง0 ถึง 122ปี

In [101]:
users_clean = users_all[users_all['CUSTOMER_ID'].notnull() & (users_all['ADDRESS_POSTAL_CODE'].notnull() )& (users_all['Age'] <= 122) &(users_all['Age'] >= 0)]

users_clean[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE        Age
0          2083               20170  29.309589
13         2390               10250  31.531507
16         2406               10150  34.369863
21         2412               11110  28.323288
22         2413               11000  35.720548

In [102]:
users_all.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE     object
Age                    float64
dtype: object

# ดังนั้นข้อมูลที่cleanทั้งหมดมี 10,541

In [103]:
len(users_clean )

10541

In [104]:
len(users_all)

10594

In [105]:
users_clean.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE     object
Age                    float64
dtype: object

In [106]:
pd.isnull(users_clean).sum() > 0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
Age                    False
dtype: bool

In [107]:
age_array=users_clean.as_matrix(columns=users_clean.columns[2:])  
age_array

array([[ 29.30958904],
       [ 31.53150685],
       [ 34.36986301],
       ...,
       [ 48.09589041],
       [ 29.91232877],
       [ 30.08493151]])

# check max min

In [108]:
users_clean.loc[users_clean['Age'].idxmax()]

CUSTOMER_ID             175004
ADDRESS_POSTAL_CODE
Age                    117.975
Name: 30161, dtype: object

In [109]:
users_clean.loc[users_clean['Age'].idxmin()]

CUSTOMER_ID              186282
ADDRESS_POSTAL_CODE       10110
Age                    0.117808
Name: 31810, dtype: object

# mean

In [110]:
import numpy as np

mean= np.mean(age_array)
mean

34.399431313865108

In [111]:
sd = np.std(age_array)
sd

9.9571972855965463